marlowe-cli/doc/tutorial.md
```mermaid
flowchart LR;
  
classDef command font-family:monospace,font-size: medium;  
classDef file fill:#ffc,stroke:#111;
      
Network(Mainnet<br>or Testnet)
StakeAddress(Stake<br>Address)
RolesCurrency(Currency<br>for Roles)

AddressCommand[marlowe-cli contract address]
class AddressCommand command

Network       -. "<span style=font-family:monospace>--testnet-magic</span>" .-> AddressCommand
StakeAddress  -. "<span style=font-family:monospace>--stake-address</span>" .-> AddressCommand
RolesCurrency -. "<span style=font-family:monospace>--roles-currency</span>" .-> AddressCommand
    
ValidatorAddress(Validator\nAddress)
AddressCommand -- "<span style=font-family:monospace>/dev/stdout</span>" --> ValidatorAddress
    
ValidatorCommand[marlowe-cli contract validator]
class ValidatorCommand command
    
Network       -.-> ValidatorCommand
StakeAddress  -.-> ValidatorCommand
RolesCurrency -.-> ValidatorCommand
    
ValidatorFile>Marlowe Validator<br>Plutus File]
class ValidatorFile file

ValidatorCommand -- "<span style=font-family:monospace>/dev/stdout</span>" --> ValidatorAddress
ValidatorCommand -- "<span style=font-family:monospace>--out-file</span>"  --> ValidatorFile

ContractFile>Marlowe Contract<br>JSON File]
StateFile>Marlowe State<br>JSON File]
class ContractFile file
class StateFile file
    
DatumCommand[marlowe-cli contract datum]
class DatumCommand command

ContractFile -- "<span style=font-family:monospace>--contract-file</span>" --> DatumCommand
StateFile    -- "<span style=font-family:monospace>--state-file</span>"    --> DatumCommand
    
DatumFile>Marlowe Datum<br>JSON File]
class DatumFile file
DatumHash[Marlowe Datum<br>Hash]

DatumCommand -- "<span style=font-family:monospace>--out-file</span>" --> DatumFile
DatumCommand -- "<span style=font-family:monospace>/dev/stdout</span>" --> DatumHash
    
InputsFile>Marlowe Inputs<br>JSON File]
class InputsFile file
MinSlot(Minimum<br>Slot)
MaxSlot(Maximum<br>Slot)
    
RedeemerCommand[marlowe-cli contract redeemer]
class RedeemerCommand command

InputsFile -. "<span style=font-family:monospace>--inputs-file</span>" .-> RedeemerCommand

RedeemerFile>Marlowe Redeemer<br>JSON File]
class RedeemerFile file

RedeemerCommand -- "<span style=font-family:monospace>--out-file</span>" --> RedeemerFile

CardanoCLI[marlowe-cli transaction]
class CardanoCLI command

ValidatorAddress -- "<span style=font-family:monospace>--script-address</span>" --> CardanoCLI
ValidatorFile    -- "<span style=font-family:monospace>--tx-in-script-file</span>" --> CardanoCLI 
DatumFile        -- "<span style=font-family:monospace>--tx-in-datum-file</span>"--> CardanoCLI
RedeemerFile     -- "<span style=font-family:monospace>--tx-in-redeemer-file</span>"--> CardanoCLI
MinSlot          -- "<span style=font-family:monospace>--invalid-before</span>"--> CardanoCLI
MaxSlot          -- "<span style=font-family:monospace>--invalid-hereafter</span>"--> CardanoCLI
    
TxBodyFile>Tx Body<br>File]
class TxBodyFile file
CardanoCLI -- "<span style=font-family:monospace>--out-file</span>" --> TxBodyFile
```
